jmeter-report/statistics.json
{
  "Product5" : {
    "transaction" : "Product5",
    "sampleCount" : 4418,
    "errorCount" : 2911,
    "errorPct" : 65.88954,
    "meanResTime" : 10.83906745133548,
    "medianResTime" : 10.0,
    "minResTime" : 2.0,
    "maxResTime" : 125.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 26.0,
    "throughput" : 14.750858073907875,
    "receivedKBytesPerSec" : 22.921989849812025,
    "sentKBytesPerSec" : 0.5847252254113413
  },
  "Product3" : {
    "transaction" : "Product3",
    "sampleCount" : 35478,
    "errorCount" : 23704,
    "errorPct" : 66.81324,
    "meanResTime" : 10.800749760414849,
    "medianResTime" : 11.0,
    "minResTime" : 1.0,
    "maxResTime" : 154.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 31.0,
    "throughput" : 118.411962017923,
    "receivedKBytesPerSec" : 186.27099439071807,
    "sentKBytesPerSec" : 4.566752592910902
  },
  "Product4" : {
    "transaction" : "Product4",
    "sampleCount" : 17918,
    "errorCount" : 12019,
    "errorPct" : 67.0778,
    "meanResTime" : 10.756780890724455,
    "medianResTime" : 10.0,
    "minResTime" : 1.0,
    "maxResTime" : 133.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 26.0,
    "throughput" : 59.79503232028619,
    "receivedKBytesPerSec" : 94.41472810475811,
    "sentKBytesPerSec" : 2.287710016160143
  },
  "Product1" : {
    "transaction" : "Product1",
    "sampleCount" : 136387,
    "errorCount" : 91028,
    "errorPct" : 66.74243,
    "meanResTime" : 10.789063473791312,
    "medianResTime" : 13.0,
    "minResTime" : 1.0,
    "maxResTime" : 153.0,
    "pct1ResTime" : 21.0,
    "pct2ResTime" : 27.0,
    "pct3ResTime" : 57.0,
    "throughput" : 454.9129612519971,
    "receivedKBytesPerSec" : 715.081525081385,
    "sentKBytesPerSec" : 17.581900189995963
  },
  "Product2" : {
    "transaction" : "Product2",
    "sampleCount" : 69222,
    "errorCount" : 46398,
    "errorPct" : 67.027824,
    "meanResTime" : 10.78508277715184,
    "medianResTime" : 12.0,
    "minResTime" : 1.0,
    "maxResTime" : 154.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 21.0,
    "pct3ResTime" : 41.0,
    "throughput" : 230.95555852128655,
    "receivedKBytesPerSec" : 364.503777744645,
    "sentKBytesPerSec" : 8.849587740224209
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 263423,
    "errorCount" : 176060,
    "errorPct" : 66.83547,
    "meanResTime" : 10.788234132934553,
    "medianResTime" : 14.0,
    "minResTime" : 1.0,
    "maxResTime" : 154.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 25.0,
    "pct3ResTime" : 50.0,
    "throughput" : 878.6360649613587,
    "receivedKBytesPerSec" : 1382.893397859137,
    "sentKBytesPerSec" : 33.86334677348745
  }
}